# Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).


number = int(input("Введите число: "))

print(f'Результат: {number * number}')
